#include <iostream>
#include "ProcessManage.h"


ProcessManage::ProcessManage(void)
{
}


ProcessManage::~ProcessManage(void)
{
}


/************************************************************************/
/* 初始化进程：创建初始进程*/
/************************************************************************/
void ProcessManage::init() {
	std::cout << ">>系统已启动，请输入相应指令进行操作" << std::endl;
	std::cout << ">>";
}


/************************************************************************/
/* 创建进程：
	name：新建进程名
	priority：新建进程优先级*/
/************************************************************************/
bool ProcessManage::createProcess(std::string name, int priority) {
	std::cout << ">>进程： " << name << " 创建成功，优先级为：" << priority << std::endl;
	std::cout << ">>";

	return true;
}

/************************************************************************/
/* 删除进程：
	name：删除的进程名*/
/************************************************************************/
bool ProcessManage::deleteProcess(std::string name) {
	std::cout << ">>进程： " << name << " 删除成功" << std::endl;
	std::cout << ">>";

	return true;
}

/************************************************************************/
/* 查看进程列表：*/
/************************************************************************/
bool ProcessManage::listProcess() {
	std::cout << ">>进程列表如下：" << std::endl;

	return true;
}

/************************************************************************/
/* 时钟中断：*/
/************************************************************************/
bool ProcessManage::timeInt() {
	std::cout << ">>时钟中断" << std::endl;

	return true;
}